In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Q.1

In [3]:
df=pd.read_csv("Cutlets.csv")
df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [7]:
a=df['Unit A']
b=df['Unit B']

In [8]:
import seaborn as sn
from scipy import stats

In [10]:
stats.ttest_ind(df['Unit A'],df['Unit B'])

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [ ]:
# for Q.1 Pvalue (0.72)>(0.05) Accept hte null hypothesis

# Q.2

In [11]:
l=pd.read_csv('LabTAT.csv')

In [12]:
l.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [15]:
a=l['Laboratory 1']

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: Laboratory 1, Length: 120, dtype: float64

In [21]:
l.dtypes

Laboratory 1    float64
Laboratory 2    float64
Laboratory 3    float64
Laboratory 4    float64
dtype: object

In [23]:
stats.f_oneway(l['Laboratory 1'],l['Laboratory 2'],l['Laboratory 3'],l['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [ ]:
# For Q.2 P-value <0.05 Reject the null.

# Q.3

In [25]:
from sklearn.feature_selection import chi2
from scipy.stats import chi2_contingency

In [28]:
data=[[50,142,132,70],[550,351,480,350]]
data

[[50, 142, 132, 70], [550, 351, 480, 350]]

In [30]:
stats,p,dof,expected=chi2_contingency(data)
stats,p,dof,expected

(80.46052746448156,
 2.4448395426418313e-17,
 3,
 array([[111.24705882,  91.408     , 113.472     ,  77.87294118],
        [488.75294118, 401.592     , 498.528     , 342.12705882]]))

In [ ]:
# Q.3 As pvalue <0.05 Reject the null

# Q.4 which test do we need to perform chisquare or annova